"""
Задание 7.	Напишите программу, доказывающую или проверяющую, что для множества
натуральных чисел выполняется равенство: 1+2+...+n = n(n+1)/2,
где n - любое натуральное число.

Пример:
для n = 5
1+2+3+4+5 = 5(5+1)/2

Нужно написать рекурсивную ф-цию только для левой части выражения!
Результат нужно сверить с правой частью.
Правой части выражения в рекурсивной ф-ции быть не должно!

Решите через рекурсию. В задании нельзя применять циклы.
"""


def row(n, result=0, counter=1):
    if counter > n:
        return result == int(n * (n + 1) / 2)
    result += counter
    return row(n, result, counter + 1)


if __name__ == '__main__':
    print(row(5))
    print(row(6))
    