"""
Задание 3.	Сформировать из введенного числа
обратное по порядку входящих в него
цифр и вывести на экран. Например, если введено число 3486,
то надо вывести число 6843.

Подсказка:
На каждом шаге вам нужно 'доставать' из числа очередную цифру
Пока все числа не извлечены рекурсивные вызовы продолжаем
Условие завершения рекурсии - все цифры извлечены
Используем операции % //. Операции взятия по индексу применять нельзя.

Решите через рекурсию. В задании нельзя применять циклы.

Пример:
Введите число, которое требуется перевернуть: 123
Перевернутое число: 321
Не забудьте проверить на числе, которое оканчивается на 0.
1230 -> 0321
"""


def inverse_number(number, finish_number='Перевернутое число: '):
    if number == 0:
        return finish_number
    else:
        current_number = number % 10
        number //= 10
    return inverse_number(number, str(finish_number) + str(current_number))


input_num = int(input('Введите число, которое требуется перевернуть: '))

print(inverse_number(input_num))
