"""
Задание 2.	Подсчитать четные и нечетные цифры введенного натурального числа.
Например, если введено число 34560, то у него 3 четные цифры
(4, 6 и 0) и 2 нечетные (3 и 5).

Подсказка:
На каждом шаге вам нужно 'доставать' из числа очередную цифру
и смотреть является ли она четной или нечетной.
При этом увеличиваем соответствующий счетчик
Пока все числа не извлечены, рекурсивные вызовы продолжаем
Условие завершения рекурсии - все числа извлечены
Используем операции % //. Операции взятия по индексу применять нельзя.

Решите через рекурсию. Решение через цикл не принимается.

Пример:
Введите число: 123
Количество четных и нечетных цифр в числе равно: (1, 2)
"""


def parity(number, parity_num, not_parity):

    if number < 1:
        return f"Четных {parity_num}, Нечетных {not_parity}"
    else:
        if number & 1:
            not_parity += 1
        else:
            parity_num += 1
        return parity(number // 10, parity_num, not_parity)


print(parity(int(input("Введите число")), 0, 0))
