"""
Задание 3.	Сформировать из введенного числа
обратное по порядку входящих в него
цифр и вывести на экран. Например, если введено число 3486,
то надо вывести число 6843.

Подсказка:
На каждом шаге вам нужно 'доставать' из числа очередную цифру
Пока все числа не извлечены рекурсивные вызовы продолжаем
Условие завершения рекурсии - все цифры извлечены
Используем операции % //. Операции взятия по индексу применять нельзя.

Решите через рекурсию. Решение через цикл не принимается.

Пример:
Введите число, которое требуется перевернуть: 123
Перевернутое число: 321
Не забудьте проверить на числе, которое оканчивается на 0.
"""


# не cмог придумать как сделать без списка если не копипастить с вашего примера
def reverse_num(number, reverse_list):
    if number == 0:
        return ''.join(map(str, reverse_list))
    a = number % 10
    reverse_list.append(a)
    return reverse_num(number//10, reverse_list)


print(reverse_num(34045680, []))
