"""
Задание 3.	Сформировать из введенного числа
обратное по порядку входящих в него
цифр и вывести на экран. Например, если введено число 3486,
то надо вывести число 6843.

Подсказка:
На каждом шаге вам нужно 'доставать' из числа очередную цифру
Пока все числа не извлечены рекурсивные вызовы продолжаем
Условие завершения рекурсии - все цифры извлечены
Используем операции % //. Операции взятия по индексу применять нельзя.

Решите через рекурсию. Решение через цикл не принимается.

Пример:
Введите число, которое требуется перевернуть: 123
Перевернутое число: 321
Не забудьте проверить на числе, которое оканчивается на 0.
1230->0321
"""
def get_rev_number(number, rev_number = ''):
    # базовый случай!!!
    if number == 0:
        return rev_number
    else:
        # шаг рекурсии
        last_number = number % 10
        rev_number += str(last_number)
        return get_rev_number(number // 10, rev_number)

print(get_rev_number(1230))
