"""
Задание 5. На закрепление навыков работы со стеком

Реализуйте структуру "стопка тарелок".

Мы можем складывать тарелки в стопку и при превышении некоторого значения
нужно начать складывать тарелки в новую стопку.

Структура должна предусматривать наличие нескольких стеков.
Создание нового стека происходит при достижении предыдущим
стеком порогового значения.

После реализации структуры, проверьте ее работу на различных сценариях.

Примечание: ПРОШУ ВАС ВНИМАТЕЛЬНО ЧИТАТЬ ЗАДАНИЕ!
--реализуйте по аналогии с примером, рассмотренным на уроке
--создание нового стека можно реализовать добавлением новой пустой стопки
в массив стопок (lst = [[], [], [], [],....]) либо созданием объекта
класса-стек в самом же классе.
"""
lst = []

def stacks_of_plates(lst, count):
    lst.append([])
    for x in range(count):
        lst[-1].append('тарелка')
        if len(lst[-1]) == 5:
            count -= 5
            return stacks_of_plates(lst, count)
    if len(lst[-1]) == 0:
            lst.pop(-1)
    return lst
print(stacks_of_plates(lst, 12))
