"""
Задание 3.
Определить количество различных (уникальных) подстрок
с использованием хеш-функции.
Дана строка S длиной N, состоящая только из строчных латинских букв.

Подсказка: вы должны в цикле для каждой подстроки вычислить хеш
Все хеши записываем во множество.
Оно отсечет дубли.

Экономия на размере хранимых данных (для длинных строк) и
скорость доступа вместе с уникальностью элементов,
которые даёт множество, сделают решение коротким и эффективным.

Пример:
рара - 6 уникальных подстрок

рар
ра
ар
ара
р
а
"""


from itertools import combinations
from hashlib import md5


def small_str_count(word):
    return {(word[i:j], md5(word[i:j].encode()).hexdigest()) for i, j in combinations(range(len(word)), 2)}


small_str = small_str_count("Папа")
print(len(small_str), small_str)
