"""
Задание 4.
Реализуйте скрипт "Кэширование веб-страниц"

Функция должна принимать url-адрес и проверять
есть ли в кэше соответствующая страница или нет
есть ли в кэше соответствующая страница или нет

Пример кэша: {'url-адрес': 'хеш url-а'; 'url-адрес': 'хеш url-а'; ...}

Если страница в кэше есть, просто вернуть значение хеша, например, 'хеш url-а'
Если страницы в кэше нет, то вычислить хеш и записать в кэш

Подсказка: задачу решите обязательно с применением 'соленого' хеширования
и одного из алгоритмов, например, sha512
Можете усложнить задачу, реализовав ее через ООП
"""
import hashlib

cache = dict()


def get_url_cache(cache, url):
    return cache.setdefault(url, hashlib.sha512(url.encode('utf-8') + 'salt'.encode('utf-8')))


print(get_url_cache(cache, 'http'))
print(get_url_cache(cache, 'http'))
print(get_url_cache(cache, 'https'))
print(cache)
