"""
Задание 3.
Определить количество различных (уникальных) подстрок
с использованием хеш-функции.
Дана строка S длиной N, состоящая только из строчных латинских букв.

Подсказка: вы должны в цикле для каждой подстроки вычислить хеш
Все хеши записываем во множество.
Оно отсечет дубли.

Экономия на размере хранимых данных (для длинных строк) и
скорость доступа вместе с уникальностью элементов,
которые даёт множество, сделают решение коротким и эффективным.

Пример:
рара - 6 уникальных подстрок

рар
ра
ар
ара
р
а
"""
import hashlib
st = 'papa'
unique_hashes = set()
for i in range(0, len(st)):
    for j in range(i + 1, len(st) + 1):
        sub_str = st[i:j]
        unique_hashes.add(hashlib.sha256(sub_str.encode()).hexdigest())
print(len(unique_hashes)-1)

