"""
Задание 4.

Приведены два алгоритма. В них определяется число,
которое встречается в массиве чаще всего.

Сделайте профилировку каждого алгоритма через timeit

Обязательно напишите третью версию (здесь возможно даже решение одной строкой).
Сделайте замеры и опишите, получилось ли у вас ускорить задачу.
"""
from timeit import timeit

array = [1, 3, 1, 3, 4, 5, 1]


def func_1():
    m = 0
    num = 0
    for i in array:
        count = array.count(i)
        if count > m:
            m = count
            num = i
    return f'Чаще всего встречается число {num}, ' \
           f'оно появилось в массиве {m} раз(а)'


def func_2():
    new_array = []
    for el in array:
        count2 = array.count(el)
        new_array.append(count2)

    max_2 = max(new_array)
    elem = array[new_array.index(max_2)]
    return f'Чаще всего встречается число {elem}, ' \
           f'оно появилось в массиве {max_2} раз(а)'


def func_3():
    elem = max(array, key=array.count)
    return f'Чаще всего встречается число {elem}, ' \
           f'оно появилось в массиве {array.count(elem)} раз(а)'


print(func_1())
print(func_2())
print(func_3())

print("func_1", timeit("func_1()", number=2000000, globals=globals()), "seconds")
print("func_2", timeit("func_2()", number=2000000, globals=globals()), "seconds")
print("func_3", timeit("func_3()", number=2000000, globals=globals()), "seconds")

# Третий вариант самый быстрый, тк используются встроенные функции, которые имеют самое большое быстродействие. Но по времени сопоставимо с первым вариантом
# func_1 4.3276527 seconds
# func_2 6.4848463999999995 seconds
# func_3 4.1112109 seconds
