"""
Задание 3.

Для этой задачи:
1) придумайте 2-3 решения (обязательно с различной сложностью)
2) оцените сложность каждого выражения в этих решениях
3) оцените итоговую сложность каждого решения в нотации О-большое
3) сделайте вывод, какое решение эффективнее и почему

Сама задача:
Имеется хранилище с информацией о компаниях: название и годовая прибыль.
Для реализации хранилища можно применить любой подход,
который вы придумаете, например, реализовать словарь.
Реализуйте поиск трех компаний с наибольшей годовой прибылью.
Выведите результат.

Примечание: ПРОШУ ВАС ВНИМАТЕЛЬНО ЧИТАТЬ ЗАДАНИЕ!
"""
company_profit = dict([('Apple',57411),
                       ('Saudi Aramco',49287),
                       ('SoftBank Group',47053),
                       ('Industrial & Commercial Bank of China',45783),
                       ('Microsoft',44281),
                       ('',),('',),('',),('',),('',),
                       ('',),('',),('',),('',),('',),('',),('',),('',),('',),('',),
                       ('',),('',),('',),('',),('',),('',),('',),('',),('',),('',),
                       ('',),('',),('',),('',),('',),('',),('',),('',),('',),('',),
                       ('',),('',),('',),('',),('',),('',),('',),('',),('',),('',),])