""" Оптимизировал урок 1 задание курса основ. Заменил конкатенацию на f-строки, которые занимают меньше памяти
для вычесления"""

"""1. Реализовать вывод информации о промежутке времени в зависимости от его продолжительности duration в секундах:
до минуты: <s> сек;
* до часа: <m> мин <s> сек;
* до суток: <h> час <m> мин <s> сек;
* *до месяца, до года, больше года: по аналогии.
"""
from memory_profiler import profile

num = 3564365463546354513541365416355413524135416534165345134514565651665566565

@profile()
def conk(duration):
    month = duration // 2592000
    d = (duration - month * 2592000) // 86400
    h = (duration - month * 2592000 - d * 86400) // 3600
    m = (duration - month * 2592000 - d * 86400 - h * 3600) // 60
    s = duration % 60

    print(str(month) + " месяца" + str(d) + "дней" + str(h) + "часов" + str(m) + "минут" + str(s) + "секунд")


conk(num)


@profile()
def f_str(duration):
    month = duration // 2592000
    d = (duration - month * 2592000) // 86400
    h = (duration - month * 2592000 - d * 86400) // 3600
    m = (duration - month * 2592000 - d * 86400 - h * 3600) // 60
    s = duration % 60

    print(f'{month} месяца {d} дней {h} часов {m} минут {s} секунд')


f_str(num)